emacs/configs/programming/04-ruby.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1252400">1. Ruby Development Configuration</a>
<ul>
<li><a href="#org04c4d57">1.1. Overview</a></li>
<li><a href="#org2602866">1.2. Key Features</a>
<ul>
<li><a href="#org4e46934">1.2.1. Ruby Mode</a></li>
<li><a href="#org3228bcc">1.2.2. Ruby on Rails</a></li>
<li><a href="#org4381c49">1.2.3. Development Tools</a></li>
<li><a href="#org7d91765">1.2.4. Workflow Integration</a></li>
</ul>
</li>
<li><a href="#org1cfe667">1.3. Ruby</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1252400" class="outline-2">
<h2 id="org1252400"><span class="section-number-2">1.</span> Ruby Development Configuration</h2>
<div class="outline-text-2" id="text-1">
<p>
Configuration for Ruby and Ruby on Rails development.
</p>
</div>

<div id="outline-container-org04c4d57" class="outline-3">
<h3 id="org04c4d57"><span class="section-number-3">1.1.</span> Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This module provides comprehensive Ruby development support:
</p>
<ul class="org-ul">
<li><b><b>Language Support</b></b>: ruby-mode with enhanced features</li>
<li><b><b>Rails Integration</b></b>: Full Ruby on Rails support</li>
<li><b><b>REPL</b></b>: inf-ruby for interactive development</li>
<li><b><b>Testing</b></b>: RSpec and minitest integration</li>
<li><b><b>Code Quality</b></b>: RuboCop integration</li>
<li><b><b>Package Management</b></b>: Bundler support</li>
</ul>
</div>
</div>

<div id="outline-container-org2602866" class="outline-3">
<h3 id="org2602866"><span class="section-number-3">1.2.</span> Key Features</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4e46934" class="outline-4">
<h4 id="org4e46934"><span class="section-number-4">1.2.1.</span> Ruby Mode</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>Syntax highlighting</li>
<li>Intelligent indentation</li>
<li>Code navigation</li>
<li>Symbol navigation</li>
</ul>
</div>
</div>

<div id="outline-container-org3228bcc" class="outline-4">
<h4 id="org3228bcc"><span class="section-number-4">1.2.2.</span> Ruby on Rails</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Rails-specific features</li>
<li>Generator integration</li>
<li>Migration helpers</li>
<li>View/controller switching</li>
</ul>
</div>
</div>

<div id="outline-container-org4381c49" class="outline-4">
<h4 id="org4381c49"><span class="section-number-4">1.2.3.</span> Development Tools</h4>
<div class="outline-text-4" id="text-1-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tool</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>ruby-mode</code></td>
<td class="org-left">Core Ruby language support</td>
</tr>

<tr>
<td class="org-left"><code>inf-ruby</code></td>
<td class="org-left">Interactive Ruby REPL</td>
</tr>

<tr>
<td class="org-left"><code>rspec-mode</code></td>
<td class="org-left">RSpec test runner</td>
</tr>

<tr>
<td class="org-left"><code>rubocop</code></td>
<td class="org-left">Ruby style checker</td>
</tr>

<tr>
<td class="org-left"><code>bundler</code></td>
<td class="org-left">Gem dependency management</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7d91765" class="outline-4">
<h4 id="org7d91765"><span class="section-number-4">1.2.4.</span> Workflow Integration</h4>
<div class="outline-text-4" id="text-1-2-4">
<ol class="org-ol">
<li>Project detection (Rails vs. pure Ruby)</li>
<li>Bundler gem management</li>
<li>Test runner integration</li>
<li>Code formatting and linting</li>
</ol>
</div>
</div>
</div>
